[
  {
    "ID": "education_for_eternity",
    "TALK_NAME": "Education for Eternity",
    "SPEAKER_NAME": "Spencer W. Kimball",
    "IMG_PATH": "kimball.png",
    "HYPERLINK": "https://speeches.byu.edu/talks/spencer-w-kimball/education-eternity/",
    "QUOTE": "The uniqueness of Brigham Young University lies in its special role—education for eternity—which... means concern—curricular and behavioral—for not only the 'whole man' but for the 'eternal man.'",
    "QUOTE_FONT_SIZE": 16,
    "DAY": 12,
    "MONTH": "September",
    "YEAR": 1967,
    "THOUGHTS": "This talk expanded my view of BYU's aims and goals and served as a reminder of how the Spirit can guide me in my education and transform my learning. I was prompted to ponder about what \"spiritual exercise\" looks like, and I came to the idea that for me, spiritual exercise is about growing my trust and faith in Jesus Christ, and gaining resilience against temptations and attacks on my faith. This talk and this exercise taught me that my experience here at BYU is far more than just an education; it's an opportunity for me to grow closer to Christ and listen to the Spirit as I exercise my faith.",
    "QUESTIONS": "How can I invite the Spirit into both the temporal and spiritual aspects of my life?\nHow can I grow in knowledge and faith every day?\nHow can I align my goals with those of BYU and use its unique tools as a resource?"
  },
  {
    "ID": "covenant_vs_consumer",
    "TALK_NAME": "Covenant Versus Consumer Education",
    "SPEAKER_NAME": "Ari Berman",
    "IMG_PATH": "berman.jpg",
    "HYPERLINK": "https://speeches.byu.edu/talks/ari-berman/covenant-versus-consumer-education/",
    "QUOTE": "We should all be seen as equal objects of favor and respect before God and build lives of intrinsic human dignity and individuality.",
    "QUOTE_FONT_SIZE": 20,
    "DAY": 31,
    "MONTH": "January",
    "YEAR": 2023,
    "THOUGHTS": "I really liked this talk given by Ari Berman. It asked the question of whether we are seeking to be part of a consumer society or a covenant community. Berman went on to draw distinctions between relationships in both mindsets. In class, we had a really great discussion about the qualities of a covenant community at BYU and the qualities of a consumer society at SU. What particularly stood out to me was the distinction Berman made about the consumer \"I\" versus the covenant \"we\". In a consumer society, Everything is about me, All my relationships are transactional, and it's all about how much stuff I have. In a covenant community, my focus is on service and bringing up other people, creating strong relationships, and exercising faith and trust in others. Ultimately, a covenant community is about growth and service and understanding. As I go through BYU, my mission, and beyond, I want to live in and create a covenant community.",
    "QUESTIONS": "What aspects of my life reflect a consumer society or covenant community?\nWhat am I doing or can be doing to serve and have faith and trust in others?\nHow can I allow the Spirit to guide me as I shift my mindset?"
  },
  {
    "ID": "peacemakers_needed",
    "TALK_NAME": "Peacemakers Needed",
    "SPEAKER_NAME": "Russell M. Nelson",
    "IMG_PATH": "nelson.png",
    "HYPERLINK": "https://www.churchofjesuschrist.org/study/general-conference/2023/04/47nelson?lang=eng",
    "QUOTE": "You have your agency to choose contention or reconciliation. I urge you to choose to be a peacemaker, now and always.",
    "QUOTE_FONT_SIZE": 20,
    "DAY": 2,
    "MONTH": "April",
    "YEAR": 2023,
    "THOUGHTS": "President Nelson's talk prompted me to reflect on any \"prejudice, condemnation, or contention\" that exists in my heart. I pondered how I was contributing or not contributing to creating a community of belonging here at BYU. I was reminded that \"True disciples of Jesus Christ are peacemakers\" and that while being passive and avoiding conflict also avoids contention, Christ asks me to go a step further — to be a peacemaker and to \"build, lift, encourage, persuade, and inspire — no matter how difficult the situation.\" I can be an active disciple of Christ when it comes to strengthening our BYU community and helping others to receive Christ's light.",
    "QUESTIONS": "What am I doing right now to reduce \"prejudice, condemnation, or contention\" in my community?\nWhat am I doing in my life that is keeping me from being a more effective peacemaker and disciple of Christ?\nHow can I use the teachings of Jesus Christ to reduce contention and conflict and create understanding?"
  },
  {
    "ID": "the_pursuit_of_all_truth",
    "TALK_NAME": "The Pursuit of All Truth",
    "SPEAKER_NAME": "Kevin J. Worthen",
    "IMG_PATH": "worthen.jpg",
    "HYPERLINK": "https://speeches.byu.edu/talks/kevin-j-worthen/truth-3/",
    "QUOTE": "My message to you today is that truth does exist, it does matter, and it can be discerned. A major part of your purpose here at BYU is to enhance your knowledge of the truth and your ability to discern it.",
    "QUOTE_FONT_SIZE": 16,
    "DAY": 10,
    "MONTH": "January",
    "YEAR": 2017,
    "THOUGHTS": "President Worthen's talk taught me about ways in which I can seek and understand truth. His talk helped me to understand how we can receive truth from both temporal and spiritual sources, and that all truth magnifies all truth. This means that learning and applying spiritual truth helps me to better understand my secular studies, and the greater truth I learn from my secular studies, the better able I will be to understand spiritual truth. His talk also taught me how BYU's pursuit of truth is aligned with our eternal goal to expand our knowledge with that which is true. I can seek truth in all aspects of my education and listen to the spirit to confirm spiritual truths.",
    "QUESTIONS": "How can I use the truth I have learned to better become a disciple of Jesus Christ?\nWhere am I searching for truth right now?\nWhere can I go to find more truth?"
  },
  {
    "ID": "an_eye_single",
    "TALK_NAME": "An Eye Single",
    "SPEAKER_NAME": "Patricia T. Holland",
    "IMG_PATH": "patricia_holland.jpg",
    "HYPERLINK": "https://speeches.byu.edu/talks/patricia-t-holland/eye-single/",
    "QUOTE": "We all need a higher image of ourselves, but Satan would have us believe it comes totally from the praise of others when in fact it comes from our relationship with God.",
    "QUOTE_FONT_SIZE": 18,
    "DAY": 10,
    "MONTH": "September",
    "YEAR": 1985,
    "THOUGHTS": "Sister Holland's talk was a powerful reminder of how my mindset and the focus of my life can change what I think I am capable of and thus allow me to do things that I never thought before possible. Like Sister Holland had, I have struggled with overly worrying about what other people might think about me. But I can practice, as Sister Holland did, having an \"eye... single to [Christ's] glory, [that my] whole [body] shall be filled with light.\" I can let Christ's light magnify my actions and let Him work through me. I am reminded of Dallas Jenkins's forum, where he learned that he wasn't called to do God's work all on his own. His job \"wasn't to feed the five thousand, but was to provide the loaves and fish\". As I exercise trust in God, he will direct my talks, church lessons, and spiritual thoughts so that I can focus on Him rather than the judgements of the world.",
    "QUESTIONS": "How can I trust in God and worry less about appearing perfect?\nHow can I help others to feel His spirit by creating a covenant community free of judgement?\nWhen have I experienced times where the Spirit has filled me with light?"
  },
  {
    "ID": "to_choose_and_keep_a_mentor",
    "TALK_NAME": "To Choose and Keep a Mentor",
    "SPEAKER_NAME": "Henry B. Eyring",
    "IMG_PATH": "eyring.jpg",
    "HYPERLINK": "https://speeches.byu.edu/talks/henry-b-eyring/choose-keep-mentor/",
    "QUOTE": "You will find that he knew the way and wanted to share it with you. And you will have confirmed to you that he was the perfect example in mentoring, as he is in all service that brings real value.",
    "QUOTE_FONT_SIZE": 16,
    "DAY": 26,
    "MONTH": "August",
    "YEAR": 1993,
    "THOUGHTS": "President Eyring's talk was impactful in how it helped me to recognize the importance of mentors and mentorship in my life. As I go through life, I have realized that there are so many voices and people wanting to influence my agency. But true mentors are those who want to magnify my agency and help me reach my full potential. I also learned from our talks that we had in class about qualities about mentors and mentees that, to be a successful mentee, I must trust completely and listen with intent to improve and learn from their correction. Finally, I learned that I can apply these principles to the greatest mentor of all: Jesus Christ. I can exercise trust and faith in Him and learn from what he has taught me.",
    "QUESTIONS": "Who are the mentors in my life?\nWhat are the qualities of good mentors and mentees?\nHow can I be a mentor to others, or be a teachable mentee?"
  }
]
